# <center> Movies Project Part 3.3 </center>

## Creating an SQL Database

### Task
- create a relational MySQL database called ‘movies’
-create the following 5 tables
  - title_basics
  - title_ratings
  - title_genres
  - genres
  - tmdb_data

- remove columns requested by Stakeholder
-normalize all our tables with the exception of the 'tmdb_data'. Our Stakeholders want to keep all of the API data in one table.

### Data Contributions

- The Movie Database (TMDB) API 

  - Link to API website: [Click Here](https://developer.themoviedb.org/docs)

- IMDb - a community built movie and TV database.

  - Link to website: [Click Here](https://datasets.imdbws.com/)

### Import Libraries

In [1]:
import pandas as pd
import numpy as np

#allows us to connect to our MySQL database from Python
import pymysql
pymysql.install_as_MySQLdb()

#wrapper for Python that allows us to write SQL queries in Python
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

### Upload Data

In [2]:
# Open basics dataset and preview
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

In [3]:
# Open ratings dataset and preview
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1989
1  tt0000002            5.8       264
2  tt0000005            6.2      2651
3  tt0000006            5.0       182
4  tt0000007            5.4       829

In [4]:
# Open api dataset and preview
api_results = pd.read_csv("Data/FINAL_COMBINED_MOVIES.csv.gz", low_memory = False)
api_results.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
2,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
3,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.115,2194.0,PG
4,tt0118852,0.0,/vceiGZ3uavAEHlTA7v0GjQsGVKe.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,Chinese Coffee,...,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.800,49.0,R

In [5]:
#deleting row 0
api_results = api_results.drop(index=0)
api_results.head(3)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
1,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
2,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
3,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.115,2194.0,PG

## Transforming/Cleaning the Data for our Database

### Stakeholder Required Information from Title Basics

- Movie ID (tconst)
- Primary Title
- Start Year
- Runtime (in Minutes)
- Genres

### Normalizing Genres
(Normalizing is basically looking for ways to structure your database to help avoid repetitive information and improve funtionality. Get more info: [Click Here](https://www.geeksforgeeks.org/normal-forms-in-dbms/) )

We will use the single string of genres from the title basics dataset to create the 2 new tables below with their respective columns.


title_genres:
- tconst
- genre_id

genres:
- genre_id
- genre_name

In [6]:
#displaying data info
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82027 entries, 0 to 82026
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          82027 non-null  object
 1   titleType       82027 non-null  object
 2   primaryTitle    82027 non-null  object
 3   originalTitle   82027 non-null  object
 4   isAdult         82027 non-null  int64
 5   startYear       82027 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  82027 non-null  int64
 8   genres          82027 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 5.6+ MB

In [7]:
# creating a list of the columns not wanted
basics_columns_todrop = ['titleType','originalTitle','isAdult','endYear']
# dropping the list of columns
basics.drop(columns=basics_columns_todrop,inplace=True)

In [8]:
#convert the genres string in the genres column into a list of genres
#store the new list of genres in a new column called 'genres_split'
basics['genres_split'] = basics['genres'].str.split(',')
#display to see if changes were made
basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,[Drama]
2,tt0068865,Lives of Performers,2016.0,90,Drama,[Drama]
3,tt0069049,The Other Side of the Wind,2018.0,122,Drama,[Drama]
4,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...
82022,tt9914942,Life Without Sara Amat,2019.0,74,Drama,[Drama]
82023,tt9915872,The Last White Witch,2019.0,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
82024,tt9916170,The Rehearsal,2019.0,51,Drama,[Drama]
82025,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
82026,tt9916362,Coven,2020.0,92,"Drama,History","[Drama, History]"

In [9]:
#use .explode() to create new rows for movies with multiple genres
exploded_genres = basics.explode('genres_split')
#display (we can see that a new rows were created for the movie Kate & Leopold for each genre)
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,Drama
2,tt0068865,Lives of Performers,2016.0,90,Drama,Drama
...,...,...,...,...,...,...
82025,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Action
82025,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Adventure
82025,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Thriller
82026,tt9916362,Coven,2020.0,92,"Drama,History",Drama
82026,tt9916362,Coven,2020.0,92,"Drama,History",History

In [10]:
#use .unique() to create a list of unique genres from the genres_split column
#we will use this to help us create the genere_ids shortly
#use sorted to sort alphabetically
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [11]:
#creating the title_genres table
#saving the columns tconst & genres_split in the new df
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

We will now create the genre_ids by using the unique list of genres we created (unique_genres).

In [12]:
## Making the genre mapper dictionary
#generate a list of integers for each unique_genres
genre_ints = range(len(unique_genres))
#create a dictionary using unique_genres as dictionary keys
#and the genre_ints as the values
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [13]:
## make new genre_id column
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
#dropping the genres_split column
title_genres.drop(columns='genres_split',inplace=True)

Table 1 of 5

In [14]:
#displaying the final title_generes df for the database
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

Now we can use the Genre Map Dictionary to make the Genres Table

In [15]:
#creating a dataframe using the genre map
genres = pd.DataFrame({'genre_name':genre_map.keys(),'genre_id':genre_map.values()})

Table 2 of 5

In [16]:
#displaying the final generes df for the database
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

Finishing up the Title Basics Table

In [17]:
#drop genres_split and genres from basics column
basics.drop(columns=['genres_split','genres'],inplace=True)

Table 3 of 5

In [18]:
#displaying the final title basics df for the database
basics.head(3)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0068865,Lives of Performers,2016.0,90

### Ratings Required Information

- Movie ID (tconst)
- Average Movie Rating
- Number of Votes

In [19]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506911 entries, 0 to 506910
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         506911 non-null  object
 1   averageRating  506911 non-null  float64
 2   numVotes       506911 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.6+ MB

There are no changes needed to made to the ratings df as it already has all the required information requested by our Stakeholders.

Table 4 of 5

In [20]:
#displaying the final ratings df for the database
ratings.head(3)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1989
1  tt0000002            5.8       264
2  tt0000005            6.2      2651

### API Info Required
- Movie ID
- Revenue
- Budget
- Certification (MPAA Rating)

In [21]:
api_results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62770 entries, 1 to 62770
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                62770 non-null  object
 1   adult                  62770 non-null  float64
 2   backdrop_path          40487 non-null  object
 3   belongs_to_collection  4207 non-null   object
 4   budget                 62770 non-null  float64
 5   genres                 62770 non-null  object
 6   homepage               15081 non-null  object
 7   id                     62770 non-null  float64
 8   original_language      62770 non-null  object
 9   original_title         62770 non-null  object
 10  overview               61435 non-null  object
 11  popularity             62770 non-null  float64
 12  poster_path            57869 non-null  object
 13  production_companies   62770 non-null  object
 14  production_countries   62770 non-null  object
 15  release_date           61819 non-null  object
 16  revenue                62770 non-null  float64
 17  runtime                62770 non-null  float64
 18  spoken_languages       62770 non-null  object
 19  status                 62770 non-null  object
 20  tagline                23919 non-null  object
 21  title                  62770 non-null  object
 22  video                  62770 non-null  float64
 23  vote_average           62770 non-null  float64
 24  vote_count             62770 non-null  float64
 25  certification          15171 non-null  object
dtypes: float64(9), object(17)
memory usage: 12.5+ MB

In [22]:
#creating a list of only the columns that we want to keep
columns_to_keep = ['imdb_id','revenue','budget','certification']
#filtering out wanted columns
api_results = api_results[columns_to_keep]

Table 5 of 5

In [23]:
#displaying the final api df for the database
api_results.head(2)

     imdb_id  revenue  budget certification
1  tt0113092      0.0     0.0           NaN
2  tt0116391      0.0     0.0           NaN

### Creating SQL Database

Table Requirements:
- title_basics
- title_ratings
- title_genres
- genres
- tmdb_data

### Create Database

We will be using the Python libraries pymysql and sqlalchemy to create our MySQL database.

In [24]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "root" # (or whatever password you chose during mysql installation)
#giving our database a name
db_name = "movies"

connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [25]:
#check if database exists, if not create it
if database_exists(connection):
  print('Database already exists')
else:
  create_database(connection)
  print('Database created')

Database created

### Add Tables to Dataset

We will set the 'tconst' column as the primary key. Since it is not an integer we will need to provide a SQL datatype schema when creating our tables.

To create a datatype schema we need to create a dictionary with the column names as the key and the corresponding SQL datatype as the value. We will need to use the below chart as reference. 

**Pandas DataType** | **SQLAlquemy DataType**
--- | ---
int | Integer()
float | Float()
bool | Boolean()
object (For primary keys) |String(max_str_len+1)
object (For non-primary columns) |Text(max_str_len+1)

#### title_basics Table

In [26]:
#verifying the datatypes of the basics df
basics.dtypes

tconst             object
primaryTitle       object
startYear         float64
runtimeMinutes      int64
dtype: object

As we can see, we have 2 object datatypes, one float and one int. The tconst column will be our primary column and it is an object datatype.

In [27]:
#calculate max string lengths for our two object columns
tconst_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

In [28]:
from sqlalchemy.types import *
## Creating our basics table schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(tconst_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [29]:
#adding table to database with dtypes
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

82027

In [30]:
#selecting the 'tconst' column as the primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

#### title_ratings Table

In [31]:
#verifying the datatypes of the ratings df
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [32]:
#calculate max string lengths for object columns
ratings_len = ratings['tconst'].fillna('').map(len).max()

In [33]:
## Create a schema dictonary using Sqlalchemy datatype objects
ratings_schema = {
    "tconst": String(ratings_len+1), 
    "averageRating": Float(),
    'numVotes':Integer()}

In [34]:
#adding ratings table to database with dtypes
ratings.to_sql('title_ratings', engine,dtype=ratings_schema, if_exists='replace',index=False)

506911

In [35]:
#making 'tconst' column the primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

#### title_genres Table

In [36]:
#verifying the datatypes
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

The title_genres is a joiner table and therefor it does not have a primary key. So we can just add the table with no dtypes.

In [37]:
#adding table to database
title_genres.to_sql('title_genres', engine, if_exists = 'replace')

153838

#### genres Table

In [38]:
#verifying the datatypes
genres.dtypes

genre_name    object
genre_id       int64
dtype: object

Note that our primary ID column 'genre_id' is an integer.

In [39]:
## adding table to database AND Setting index and use index=True (only for integer primary key)
genres.set_index('genre_id').to_sql('genres',engine,index=True,if_exists = 'replace')

25

In [40]:
#selecting primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

#### tmdb_data

In [41]:
#verifying the datatypes
api_results.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object

In [42]:
#calculate max string lengths for object columns
imdb_len = api_results['imdb_id'].fillna('').map(len).max()
cert_len = api_results['certification'].fillna('').map(len).max()

In [43]:
## Create a schema dictonary using Sqlalchemy datatype objects
api_schema = {
    "imdb_id": String(imdb_len+1), 
    "certification": Text(cert_len+1),
    'revenue':Float(),
    'budget':Float()}

In [44]:
#adding table to database with dtypes
api_results.to_sql('tmdb_data', engine,dtype=api_schema, if_exists = 'replace',index=False)

62770

In [45]:
#selecting primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

### Showing all tables in database

In [46]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

### Answering Stakeholder Questions using SQL

Our Stakeholders would like for us to answer the below questions using SQL.

1.What is the Average Movie Length by year?

2.How many total movies are there in each genre?

3.What are the top 5 movies with highest revenues?

4.Which genre has the highest average rating?

5.What are the top 5 movies with highest revenues?

In order to write SQL queries using SQLAlquemy we must use the below syntax:
- Write the SQL query in this string 


```
sql = """
Replace this text
with our query!
"""

```

- Read the sql query into pandas to view the results

`pd.read_sql_query(sql, engine)`

1. What is the Average Movie Length by year?

In [47]:
sql = """
SELECT startYear, AVG(runtimeMinutes) as avg_movie_length
FROM title_basics
GROUP BY startYear
ORDER BY startYear DESC
"""

answer = pd.read_sql_query(sql, engine)
answer

    startYear  avg_movie_length
0      2021.0           96.1707
1      2020.0           93.5613
2      2019.0           97.1132
3      2018.0           96.2859
4      2017.0           94.7426
5      2016.0           94.0196
6      2015.0           93.8262
7      2014.0           94.0586
8      2013.0           94.0028
9      2012.0           93.4081
10     2011.0           93.2823
11     2010.0           93.8169
12     2009.0           93.3230
13     2008.0           93.8110
14     2007.0           94.7377
15     2006.0           95.3286
16     2005.0           96.1269
17     2004.0           97.0361
18     2003.0           96.8040
19     2002.0           96.5051
20     2001.0           96.9241
21     2000.0           96.7662

2. How many total movies are there in each genre?

In [50]:
sql = """
SELECT g.genre_name, COUNT(DISTINCT tconst) as total_movies
FROM title_genres t
    JOIN genres g
    ON t.genre_id = g.genre_id
GROUP BY g.genre_name
ORDER BY total_movies DESC
"""

answer = pd.read_sql_query(sql, engine)
answer

    genre_name  total_movies
0        Drama         43963
1       Comedy         24224
2     Thriller         12036
3       Horror         11673
4       Action         10331
5      Romance          9896
6        Crime          7738
7    Adventure          5481
8      Mystery          5259
9       Family          3838
10     Fantasy          3692
11      Sci-Fi          3570
12   Animation          2779
13   Biography          1881
14       Music          1835
15     History          1604
16       Sport          1129
17     Musical          1013
18         War           977
19     Western           481
20       Adult           339
21  Reality-TV            47
22   Talk-Show            34
23        News            16
24   Game-Show             2

3. What are the top 5 movies with highest revenues?

In [58]:
sql = """
SELECT b.primaryTitle, t.revenue
FROM title_basics b
    JOIN tmdb_data t
    ON b.tconst = t.imdb_id
ORDER BY t.revenue DESC
LIMIT 5
"""

answer = pd.read_sql_query(sql, engine)
answer

                                 primaryTitle       revenue
0                                      Avatar  2.923710e+09
1                           Avengers: Endgame  2.794730e+09
2  Star Wars: Episode VII - The Force Awakens  2.068220e+09
3                      Avengers: Infinity War  2.046240e+09
4                     Spider-Man: No Way Home  1.921850e+09

4. Which genre has the highest average rating?

In [72]:
sql = """
SELECT g.genre_name, AVG(averageRating) As Average_Rating
FROM genres g
    JOIN title_genres t
    ON t.genre_id = g.genre_id
    JOIN title_ratings r
    ON t.tconst = r.tconst
GROUP BY g.genre_name
ORDER BY Average_Rating DESC
LIMIT 1
"""

answer = pd.read_sql_query(sql, engine)
answer

  genre_name  Average_Rating
0  Talk-Show            8.25

5. Which genre has the lowest average rating?

In [73]:
sql = """
SELECT g.genre_name, AVG(averageRating) As Average_Rating
FROM genres g
    JOIN title_genres t
    ON t.genre_id = g.genre_id
    JOIN title_ratings r
    ON t.tconst = r.tconst
GROUP BY g.genre_name
ORDER BY Average_Rating ASC
LIMIT 1
"""

answer = pd.read_sql_query(sql, engine)
answer

  genre_name  Average_Rating
0     Horror        4.704142